# Змінні
artefact_found = False
good_ending = False

# Сюжетна лінія 1: Зустріч з гідом
print("Вас веде гід. Виберіть: 1 - довіритися гіду, 2 - пройти самостійно")
choice = input().lower()

if choice == '1':
    print("Ви вирішили довіритися гіду.")
else:
    print("Ви вирішили пройти самостійно.")

# Сюжетна лінія 2: Зустріч із плем'ям
print("Ви натрапили на плем'я. Взаємодіяти чи відійти? 1 - взаємодіяти, 2 - відійти")
choice = input().lower()

if choice == '1':
    print("Ви взаємодієте з плем'ям.")
else:
    print("Ви відходите від плем'я.")

# Сюжетна лінія 3: Перешкоди в джунглях
print("Подолайте перешкоди. Оберіть шлях: 1 - річка, 2 - гори, 3 - ліс")
choice = input().lower()

if choice == '1':
    print("Ви подолали річку.")
elif choice == '2':
    print("Ви обрали шлях через гори.")
else:
    print("Ви обрали лісовий маршрут.")

# Знайти артефакт
print("Ви дісталися місця, де прихований артефакт. Подолайте ловушки та загадки.")

# Фінал
print("Ви знайшли артефакт. Використати його для добра чи зла? 1 - для добра, 2 - для зла")
choice = input().lower()

if choice == '1':
    good_ending = True
    print("Ви використали артефакт для добра. Ви завершили гру з позитивним фіналом.")
else:
    print("Ви використали артефакт для зла. Ви завершили гру з негативним")