def start_game():
    print("Вітаємо у грі Надприродні пригоди Діна")
    print("Виберіть свій шлях і вирішіть долю головного героя (Діна).")
    print("1. Відправитися в ліс самому досліджувати загадкові і незрозумілі для всіх явища.")
    print("2. Поїхати самому на загадкове місце вбивства у рідному місті.")
    print("3. Поїхати з братом в інше місто тому що там були помічені дивні речі")
    choice = input("Оберіть варіант (1 або 2 або 3): ")
    
    if choice == '1':
        forest_adventure()
    elif choice == '2':
        city_adventure()
    elif choice == '3':
        secondcity_adventure()
    else:
        print("Невірний вибір. Спробуйте ще раз.")
        start_game()

def forest_adventure():
    print("\nВи вирішили відправитися в дивний ліс.")
    print("У лісі ви зустрічаєте дивну сутність або монстра ви ще й самі не розумієте хто або що це. У вас є вибір:")
    print("1. Спробувати налагодити контакт з сутністю і зрозуміти хто або що вона таке")
    print("2. Спробувати уникнути контакту і втекти від сутності.")
    
    choice = input("Оберіть варіант (1 або 2): ")
    
    if choice == '1':
        print("\nСутність виявляється дружелюбною ви з нею знайомитесь її звати Кроулі, Кроулі розповідає вам багато про цей ліс, дає вам безліч підказок про всіх монстрів які живуть в цьому лісі")
        print("З допомогою підказок Кроулі ви вбиваєте всіх монстрів у цьому лісі\nВи виграли!")
    elif choice == '2':
        print("\nВи намагалися втекти від сутності тим самим натрапивши на страшне чудисько тим самим відправивши себе на смерть.")
        print("Чудовисько вас вбиває. Смерть.\nГра закінчена.")
    else:
        print("Невірний вибір. Спробуйте ще раз.")
        forest_adventure()

def city_adventure():
    print("Ви вирішили відправитися в рідне місто")
    print("\nВи приїхали на місце дивного вбивства у своєму рідному місті\nІ одразу як ви заходите в кімнату де було скоїно вбивство вас зустрічає демон який його скоїв")
    print("Демон сидячи в кріслі сказав вам прямо в очі що вбє вас тому що ви його бачили, але він дає вам шанс вижити якщо ви вгадаєте як його звати\nТакож він дає вам підказку вона звучить так:\nЯ саме суще зло на всій планеті і моє імя починається на букву Д")
    
    demon_name = input("Введіть ім'я Демона: ").lower()
    
    if demon_name == 'демон':
        print("\nВи вгадали імя Демона тож він стримує свою обіцянку і відпускає вас")
        print("Ви вижили тож тим самим!\nВи виграли!")
    else:
        print("\nВи не змогли вгадати імя Демона тож він встає з крісла і вбиває вас\nСмерть.")
        print("Гра закінчена.")

def secondcity_adventure():
    print("Ви вирішили відправитися з братом в інше місто")
    print("Темна ніч, ви з братом їдете в інше місто його назва Канзас, і по дорозі ви бачите дивну дівчину, як вам здається на перший погляд.\nБрат каже, що треба зупинитися і спитати чи їй потрібна допомога.\nАле ви кажете, що не треба зупинятися і іхати далі")
    print("1. Послухати брата і зупинитися, спитати дівчину чи їй потрібна допомога.")
    print("2. Продовжити їхати і не звертати уваги на дівчину.")

    choice = input("Оберіть варіант (1 або 2): ")

    if choice == '1':
        print("\nВи зупинилися, спитали дівчину, але виявилося, що це був монстр, який напав на вас та вашого брата.")
        print("Вас з'їв монстр. Смерть.\nГра закінчена.")
    elif choice == '2':
        print("\nВи продовжили їхати, уникаючи зустрічі з тим, що вам здавалося дивною дівчиною.")
        print("Ви дійшли до міста безпечно. Виживання!\nВи виграли!")
    else:
        print("Невірний вибір. Спробуйте ще раз.")
        secondcity_adventure()

# Початок гри
start_game()